IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM17_CONTROLSS_G3_EPWM17.xml
	<register id="CONTROLSS_G3_EPWM17_XLOAD" acronym="CONTROLSS_G3_EPWM17_XLOAD" offset="0x418" width="32" description="XCMP Mode Load Enable Register">
		<bitfield id="FRCLD" width="1" begin="1" end="1" resetval="0x0" description="Force reload event in one shot mode : Writing a 1 to this bit turn force one load event at the input of the event pre-scale counter as shown in the diagram below. This bit is intended to be used for testing and/or software force loading of the events in global load mode. Writing of 0 will be ignored.  Always reads back a 0." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="STARTLD" width="1" begin="0" end="0" resetval="0x0" description="Enable reload event : Writing a 1 to this bit turn the one shot latch condition ON. Upon occurrence of a chosen load strobe, one shadow to active reload occurs and the latch will be cleared. Hence writing 1 to this bit would allow load strobe event to pass through and block further strobe events.  Writing of 0 will be ignored.  Always reads back a 0." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G3_EPWM17_EPWMXLINKXLOAD" acronym="CONTROLSS_G3_EPWM17_EPWMXLINKXLOAD" offset="0x41C" width="32" description="Link register across PWM modules">
		<bitfield id="XLOADLINK" width="5" begin="4" end="0" resetval="0x0" description="XLOAD Link Bits: Writes to the XLOAD registers in the ePWM module selected by the following bit selections results in a simultaneous write to the  current ePWM module's XLOAD registers  00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM17_XREGSHDW1STS" acronym="CONTROLSS_G3_EPWM17_XREGSHDW1STS" offset="0x420" width="32" description="Shadow Buffer 1 Update Status Register">
		<bitfield id="XMIN_SHDW1FULL" width="1" begin="14" end="14" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="14" rwaccess="R"/> 
		<bitfield id="XMAX_SHDW1FULL" width="1" begin="13" end="13" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="13" rwaccess="R"/> 
		<bitfield id="XAQCTLB_SHDW1FULL" width="1" begin="12" end="12" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="12" rwaccess="R"/> 
		<bitfield id="XAQCTLA_SHDW1FULL" width="1" begin="11" end="11" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="11" rwaccess="R"/> 
		<bitfield id="CMPD_SHDW1FULL" width="1" begin="10" end="10" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="10" rwaccess="R"/> 
		<bitfield id="CMPC_SHDW1FULL" width="1" begin="9" end="9" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="9" rwaccess="R"/> 
		<bitfield id="XTBPRD_SHDW1FULL" width="1" begin="8" end="8" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="8" rwaccess="R"/> 
		<bitfield id="XCMP8_SHDW1FULL" width="1" begin="7" end="7" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="7" rwaccess="R"/> 
		<bitfield id="XCMP7_SHDW1FULL" width="1" begin="6" end="6" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="6" rwaccess="R"/> 
		<bitfield id="XCMP6_SHDW1FULL" width="1" begin="5" end="5" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="5" rwaccess="R"/> 
		<bitfield id="XCMP5_SHDW1FULL" width="1" begin="4" end="4" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="4" rwaccess="R"/> 
		<bitfield id="XCMP4_SHDW1FULL" width="1" begin="3" end="3" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="3" rwaccess="R"/> 
		<bitfield id="XCMP3_SHDW1FULL" width="1" begin="2" end="2" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="2" rwaccess="R"/> 
		<bitfield id="XCMP2_SHDW1FULL" width="1" begin="1" end="1" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="1" rwaccess="R"/> 
		<bitfield id="XCMP1_SHDW1FULL" width="1" begin="0" end="0" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM17_XREGSHDW2STS" acronym="CONTROLSS_G3_EPWM17_XREGSHDW2STS" offset="0x428" width="32" description="Shadow Buffer 2 Update Status Register">
		<bitfield id="XMIN_SHDW2FULL" width="1" begin="14" end="14" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="14" rwaccess="R"/> 
		<bitfield id="XMAX_SHDW2FULL" width="1" begin="13" end="13" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="13" rwaccess="R"/> 
		<bitfield id="XAQCTLB_SHDW2FULL" width="1" begin="12" end="12" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="12" rwaccess="R"/> 
		<bitfield id="XAQCTLA_SHDW2FULL" width="1" begin="11" end="11" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="11" rwaccess="R"/> 
		<bitfield id="CMPD_SHDW2FULL" width="1" begin="10" end="10" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="10" rwaccess="R"/> 
		<bitfield id="CMPC_SHDW2FULL" width="1" begin="9" end="9" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="9" rwaccess="R"/> 
		<bitfield id="XTBPRD_SHDW2FULL" width="1" begin="8" end="8" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="8" rwaccess="R"/> 
		<bitfield id="XCMP8_SHDW2FULL" width="1" begin="7" end="7" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="7" rwaccess="R"/> 
		<bitfield id="XCMP7_SHDW2FULL" width="1" begin="6" end="6" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="6" rwaccess="R"/> 
		<bitfield id="XCMP6_SHDW2FULL" width="1" begin="5" end="5" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="5" rwaccess="R"/> 
		<bitfield id="XCMP5_SHDW2FULL" width="1" begin="4" end="4" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="4" rwaccess="R"/> 
		<bitfield id="XCMP4_SHDW2FULL" width="1" begin="3" end="3" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="3" rwaccess="R"/> 
		<bitfield id="XCMP3_SHDW2FULL" width="1" begin="2" end="2" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="2" rwaccess="R"/> 
		<bitfield id="XCMP2_SHDW2FULL" width="1" begin="1" end="1" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="1" rwaccess="R"/> 
		<bitfield id="XCMP1_SHDW2FULL" width="1" begin="0" end="0" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="0" rwaccess="R"/>
	</register>
